Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/forceVibration/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       6155;
    }
    outlet
    {
        type            patch;
        nFaces          50;
        startFace       6205;
    }
    topAndBottom
    {
        type            patch;
        nFaces          110;
        startFace       6255;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       6365;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3150;
        startFace       6445;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          3150;
        startFace       9595;
    }
)

// ************************************************************************* //
