Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/forceVibration/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    topAndBottom
    {
	type            slip;
    }
    inlet
    {
	type            fixedValue;
	value		uniform (1 0 0);
    }
    outlet
    {
	type            pressureInletOutletVelocity;
	value		uniform (0 0 0);
    } 
    "(front|back)"
    {
        type            empty;
    }
    cylinder
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
