Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/forceVibration/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0.01";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topAndBottom
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    outlet
    {
        type            uniformFixedValue;
        uniformValue    (0 0 0);
    }

    cylinder
    {
        type            solidBodyMotionDisplacement; 
        solidBodyMotionFunction  oscillatingLinearMotion;
        omega           0.5; 
        amplitude       (0 0.5 0);
        value           uniform (0 0 0);        
        
    }

    "(front|back)"
    {
        type            empty;
    }
}

