Extra_tutorials/of9_pimpleDyMFoam_vortexShedding/forceVibration/system/forcesIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates pressure and viscous forces over specified patches for a case
    where the solver is incompressible; i.e., pressure is kinematic and has
    units of m^2/s^2.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/forces/forcesIncompressible.cfg"

patches     (cylinder); // Names of patches on which to calculate forces

rhoInf      1;       // Far field density; e.g., 1.225 kg/m^3 for air

CofR        (0 0 0);         // Centre of rotation; e.g., (0 0 0)

pitchAxis   (0 0 1);    // Pitch axis; e.g., (0 1 0)

// ************************************************************************* //
